Revit 2026 API

# GenericZoneGetSketchId Method

---

Gets the sketch id for the generic zone.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GetSketchId()
```
```vb
Public Function GetSketchId As ElementId
```
```cpp
public:
ElementId^ GetSketchId()
```
```fsharp
member GetSketchId : unit -> ElementId
```

#### Return Value

ElementId The sketch element id for the sketch-based generic zone.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This generic zone must be sketch-based. |

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace